stm32duino/Arduino_Core_STM32/boards.txt
# ThunderPack F411xxE
# https://github.com/jgillick/ThunderPack/tree/STM32F4
GenF4.menu.pnum.THUNDERPACK_F411=ThunderPack v1.1+
GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_size=524288
GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_data_size=131072
GenF4.menu.pnum.THUNDERPACK_F411.build.board=THUNDERPACK_F411
GenF4.menu.pnum.THUNDERPACK_F411.build.product_line=STM32F411xE
GenF4.menu.pnum.THUNDERPACK_F411.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.THUNDERPACK_F411.build.variant=STM32F4xx/THUNDERPACK_F411

# Generic F446RE
GenF4.menu.pnum.Generic_F446RE=Generic F446RE
GenF4.menu.pnum.Generic_F446RE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F446RE.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F446RE.build.board=GENERIC_F446RE
GenF4.menu.pnum.Generic_F446RE.build.product_line=STM32F446xx
GenF4.menu.pnum.Generic_F446RE.build.variant=STM32F4xx/Generic_F446Rx

# Generic F446RC
GenF4.menu.pnum.Generic_F446RC=Generic F446RC
GenF4.menu.pnum.Generic_F446RC.upload.maximum_size=262144
GenF4.menu.pnum.Generic_F446RC.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F446RC.build.board=GENERIC_F446RC
GenF4.menu.pnum.Generic_F446RC.build.product_line=STM32F446xx
GenF4.menu.pnum.Generic_F446RC.build.variant=STM32F4xx/Generic_F446Rx

# Generic F423RH
GenF4.menu.pnum.Generic_F423RH=Generic F423RH
GenF4.menu.pnum.Generic_F423RH.upload.maximum_size=1572864
GenF4.menu.pnum.Generic_F423RH.upload.maximum_data_size=327680
GenF4.menu.pnum.Generic_F423RH.build.board=GENERIC_F423RH
GenF4.menu.pnum.Generic_F423RH.build.product_line=STM32F423xx
GenF4.menu.pnum.Generic_F423RH.build.variant=STM32F4xx/Generic_F4x3Rx

# Generic F423CH
GenF4.menu.pnum.Generic_F423CH=Generic F423CH
GenF4.menu.pnum.Generic_F423CH.upload.maximum_size=1572864
GenF4.menu.pnum.Generic_F423CH.upload.maximum_data_size=327680
GenF4.menu.pnum.Generic_F423CH.build.board=GENERIC_F423CH
GenF4.menu.pnum.Generic_F423CH.build.product_line=STM32F423xx
GenF4.menu.pnum.Generic_F423CH.build.variant=STM32F4xx/Generic_F4x3Cx

# Generic F417VG
GenF4.menu.pnum.Generic_F417VG=Generic F417VG
GenF4.menu.pnum.Generic_F417VG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F417VG.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F417VG.build.board=GENERIC_F417VG
GenF4.menu.pnum.Generic_F417VG.build.product_line=STM32F417xx
GenF4.menu.pnum.Generic_F417VG.build.variant=STM32F4xx/Generic_F4x7Vx

# Generic F417VE
GenF4.menu.pnum.Generic_F417VE=Generic F417VE
GenF4.menu.pnum.Generic_F417VE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F417VE.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F417VE.build.board=GENERIC_F417VE
GenF4.menu.pnum.Generic_F417VE.build.product_line=STM32F417xx
GenF4.menu.pnum.Generic_F417VE.build.variant=STM32F4xx/Generic_F4x7Vx

# Generic F415RG
GenF4.menu.pnum.Generic_F415RG=Generic F415RG
GenF4.menu.pnum.Generic_F415RG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F415RG.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F415RG.build.board=GENERIC_F415RG
GenF4.menu.pnum.Generic_F415RG.build.product_line=STM32F415xx
GenF4.menu.pnum.Generic_F415RG.build.variant=STM32F4xx/Generic_F4x5RG

# Generic F413RH
GenF4.menu.pnum.Generic_F413RH=Generic F413RH
GenF4.menu.pnum.Generic_F413RH.upload.maximum_size=1572864
GenF4.menu.pnum.Generic_F413RH.upload.maximum_data_size=327680
GenF4.menu.pnum.Generic_F413RH.build.board=GENERIC_F413RH
GenF4.menu.pnum.Generic_F413RH.build.product_line=STM32F413xx
GenF4.menu.pnum.Generic_F413RH.build.variant=STM32F4xx/Generic_F4x3Rx

# Generic F413RG
GenF4.menu.pnum.Generic_F413RG=Generic F413RG
GenF4.menu.pnum.Generic_F413RG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F413RG.upload.maximum_data_size=327680
GenF4.menu.pnum.Generic_F413RG.build.board=GENERIC_F413RG
GenF4.menu.pnum.Generic_F413RG.build.product_line=STM32F413xx
GenF4.menu.pnum.Generic_F413RG.build.variant=STM32F4xx/Generic_F4x3Rx

# Generic F413CH
GenF4.menu.pnum.Generic_F413CH=Generic F413CH
GenF4.menu.pnum.Generic_F413CH.upload.maximum_size=1572864
GenF4.menu.pnum.Generic_F413CH.upload.maximum_data_size=327680
GenF4.menu.pnum.Generic_F413CH.build.board=GENERIC_F413CH
GenF4.menu.pnum.Generic_F413CH.build.product_line=STM32F413xx
GenF4.menu.pnum.Generic_F413CH.build.variant=STM32F4xx/Generic_F4x3Cx

# Generic F413CG
GenF4.menu.pnum.Generic_F413CG=Generic F413CG
GenF4.menu.pnum.Generic_F413CG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F413CG.upload.maximum_data_size=327680
GenF4.menu.pnum.Generic_F413CG.build.board=GENERIC_F413CG
GenF4.menu.pnum.Generic_F413CG.build.product_line=STM32F413xx
GenF4.menu.pnum.Generic_F413CG.build.variant=STM32F4xx/Generic_F4x3Cx

# Generic F412RG
GenF4.menu.pnum.Generic_F412RG=Generic F412RG
GenF4.menu.pnum.Generic_F412RG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F412RG.upload.maximum_data_size=262144
GenF4.menu.pnum.Generic_F412RG.build.board=GENERIC_F412RG
GenF4.menu.pnum.Generic_F412RG.build.product_line=STM32F412Rx
GenF4.menu.pnum.Generic_F412RG.build.variant=STM32F4xx/Generic_F412Rx

# Generic F412RE
GenF4.menu.pnum.Generic_F412RE=Generic F412RE
GenF4.menu.pnum.Generic_F412RE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F412RE.upload.maximum_data_size=262144
GenF4.menu.pnum.Generic_F412RE.build.board=GENERIC_F412RE
GenF4.menu.pnum.Generic_F412RE.build.product_line=STM32F412Rx
GenF4.menu.pnum.Generic_F412RE.build.variant=STM32F4xx/Generic_F412Rx

# Generic F412CG
GenF4.menu.pnum.Generic_F412CG=Generic F412CG
GenF4.menu.pnum.Generic_F412CG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F412CG.upload.maximum_data_size=262144
GenF4.menu.pnum.Generic_F412CG.build.board=GENERIC_F412CG
GenF4.menu.pnum.Generic_F412CG.build.product_line=STM32F412Cx
GenF4.menu.pnum.Generic_F412CG.build.variant=STM32F4xx/Generic_F412Cx

# Generic F412CE
GenF4.menu.pnum.Generic_F412CE=Generic F412CE
GenF4.menu.pnum.Generic_F412CE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F412CE.upload.maximum_data_size=262144
GenF4.menu.pnum.Generic_F412CE.build.board=GENERIC_F412CE
GenF4.menu.pnum.Generic_F412CE.build.product_line=STM32F412Cx
GenF4.menu.pnum.Generic_F412CE.build.variant=STM32F4xx/Generic_F412Cx

# Generic F411RE
GenF4.menu.pnum.Generic_F411RE=Generic F411RE
GenF4.menu.pnum.Generic_F411RE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F411RE.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F411RE.build.board=GENERIC_F411RE
GenF4.menu.pnum.Generic_F411RE.build.product_line=STM32F411xE
GenF4.menu.pnum.Generic_F411RE.build.variant=STM32F4xx/Generic_F411Rx

# Generic F411RC
GenF4.menu.pnum.Generic_F411RC=Generic F411RC
GenF4.menu.pnum.Generic_F411RC.upload.maximum_size=262144
GenF4.menu.pnum.Generic_F411RC.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F411RC.build.board=GENERIC_F411RC
GenF4.menu.pnum.Generic_F411RC.build.product_line=STM32F411xE
GenF4.menu.pnum.Generic_F411RC.build.variant=STM32F4xx/Generic_F411Rx

# Generic F411CE
GenF4.menu.pnum.Generic_F411CE=Generic F411CE
GenF4.menu.pnum.Generic_F411CE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F411CE.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F411CE.build.board=GENERIC_F411CE
GenF4.menu.pnum.Generic_F411CE.build.product_line=STM32F411xE
GenF4.menu.pnum.Generic_F411CE.build.variant=STM32F4xx/Generic_F411Cx

# Generic F411CC
GenF4.menu.pnum.Generic_F411CC=Generic F411CC
GenF4.menu.pnum.Generic_F411CC.upload.maximum_size=262144
GenF4.menu.pnum.Generic_F411CC.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F411CC.build.board=GENERIC_F411CC
GenF4.menu.pnum.Generic_F411CC.build.product_line=STM32F411xE
GenF4.menu.pnum.Generic_F411CC.build.variant=STM32F4xx/Generic_F411Cx

# Generic F410RB
GenF4.menu.pnum.Generic_F410RB=Generic F410RB
GenF4.menu.pnum.Generic_F410RB.upload.maximum_size=131072
GenF4.menu.pnum.Generic_F410RB.upload.maximum_data_size=32768
GenF4.menu.pnum.Generic_F410RB.build.board=GENERIC_F410RB
GenF4.menu.pnum.Generic_F410RB.build.product_line=STM32F410Rx
GenF4.menu.pnum.Generic_F410RB.build.variant=STM32F4xx/Generic_F410Rx

# Generic F410R8
GenF4.menu.pnum.Generic_F410R8=Generic F410R8
GenF4.menu.pnum.Generic_F410R8.upload.maximum_size=65536
GenF4.menu.pnum.Generic_F410R8.upload.maximum_data_size=32768
GenF4.menu.pnum.Generic_F410R8.build.board=GENERIC_F410R8
GenF4.menu.pnum.Generic_F410R8.build.product_line=STM32F410Rx
GenF4.menu.pnum.Generic_F410R8.build.variant=STM32F4xx/Generic_F410Rx

# Generic F410CB
GenF4.menu.pnum.Generic_F410CB=Generic F410CB
GenF4.menu.pnum.Generic_F410CB.upload.maximum_size=131072
GenF4.menu.pnum.Generic_F410CB.upload.maximum_data_size=32768
GenF4.menu.pnum.Generic_F410CB.build.board=GENERIC_F410CB
GenF4.menu.pnum.Generic_F410CB.build.product_line=STM32F410Cx
GenF4.menu.pnum.Generic_F410CB.build.variant=STM32F4xx/Generic_F410Cx

# Generic F410C8
GenF4.menu.pnum.Generic_F410C8=Generic F410C8
GenF4.menu.pnum.Generic_F410C8.upload.maximum_size=65536
GenF4.menu.pnum.Generic_F410C8.upload.maximum_data_size=32768
GenF4.menu.pnum.Generic_F410C8.build.board=GENERIC_F410C8
GenF4.menu.pnum.Generic_F410C8.build.product_line=STM32F410Cx
GenF4.menu.pnum.Generic_F410C8.build.variant=STM32F4xx/Generic_F410Cx

