stm32duino/Arduino_Core_STM32/boards.txt
# Generic F407VG
GenF4.menu.pnum.Generic_F407VG=Generic F407VG
GenF4.menu.pnum.Generic_F407VG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F407VG.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F407VG.build.board=GENERIC_F407VG
GenF4.menu.pnum.Generic_F407VG.build.product_line=STM32F407xx
GenF4.menu.pnum.Generic_F407VG.build.variant=STM32F4xx/Generic_F4x7Vx

# Generic F407VE
GenF4.menu.pnum.Generic_F407VE=Generic F407VE
GenF4.menu.pnum.Generic_F407VE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F407VE.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F407VE.build.board=GENERIC_F407VE
GenF4.menu.pnum.Generic_F407VE.build.product_line=STM32F407xx
GenF4.menu.pnum.Generic_F407VE.build.variant=STM32F4xx/Generic_F4x7Vx

# Generic F405RG
GenF4.menu.pnum.Generic_F405RG=Generic F405RG
GenF4.menu.pnum.Generic_F405RG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F405RG.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F405RG.build.board=GENERIC_F405RG
GenF4.menu.pnum.Generic_F405RG.build.product_line=STM32F405xx
GenF4.menu.pnum.Generic_F405RG.build.variant=STM32F4xx/Generic_F4x5RG

# Generic F401RE
GenF4.menu.pnum.Generic_F401RE=Generic F401RE
GenF4.menu.pnum.Generic_F401RE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F401RE.upload.maximum_data_size=98304
GenF4.menu.pnum.Generic_F401RE.build.board=GENERIC_F401RE
GenF4.menu.pnum.Generic_F401RE.build.product_line=STM32F401xE
GenF4.menu.pnum.Generic_F401RE.build.variant=STM32F4xx/Generic_F401Rx

# Generic F401RD
GenF4.menu.pnum.Generic_F401RD=Generic F401RD
GenF4.menu.pnum.Generic_F401RD.upload.maximum_size=393216
GenF4.menu.pnum.Generic_F401RD.upload.maximum_data_size=98304
GenF4.menu.pnum.Generic_F401RD.build.board=GENERIC_F401RD
GenF4.menu.pnum.Generic_F401RD.build.product_line=STM32F401xE
GenF4.menu.pnum.Generic_F401RD.build.variant=STM32F4xx/Generic_F401Rx

# Generic F401RC
GenF4.menu.pnum.Generic_F401RC=Generic F401RC
GenF4.menu.pnum.Generic_F401RC.upload.maximum_size=262144
GenF4.menu.pnum.Generic_F401RC.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401RC.build.board=GENERIC_F401RC
GenF4.menu.pnum.Generic_F401RC.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401RC.build.variant=STM32F4xx/Generic_F401Rx

# Generic F401RB
GenF4.menu.pnum.Generic_F401RB=Generic F401RB
GenF4.menu.pnum.Generic_F401RB.upload.maximum_size=131072
GenF4.menu.pnum.Generic_F401RB.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401RB.build.board=GENERIC_F401RB
GenF4.menu.pnum.Generic_F401RB.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401RB.build.variant=STM32F4xx/Generic_F401Rx

# Generic F401CE
GenF4.menu.pnum.Generic_F401CE=Generic F401CE
GenF4.menu.pnum.Generic_F401CE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F401CE.upload.maximum_data_size=98304
GenF4.menu.pnum.Generic_F401CE.build.board=GENERIC_F401CE
GenF4.menu.pnum.Generic_F401CE.build.product_line=STM32F401xE
GenF4.menu.pnum.Generic_F401CE.build.variant=STM32F4xx/Generic_F401Cx

# Generic F401CD
GenF4.menu.pnum.Generic_F401CD=Generic F401CD
GenF4.menu.pnum.Generic_F401CD.upload.maximum_size=393216
GenF4.menu.pnum.Generic_F401CD.upload.maximum_data_size=98304
GenF4.menu.pnum.Generic_F401CD.build.board=GENERIC_F401CD
GenF4.menu.pnum.Generic_F401CD.build.product_line=STM32F401xE
GenF4.menu.pnum.Generic_F401CD.build.variant=STM32F4xx/Generic_F401Cx

# Generic F401CC
GenF4.menu.pnum.Generic_F401CC=Generic F401CC
GenF4.menu.pnum.Generic_F401CC.upload.maximum_size=262144
GenF4.menu.pnum.Generic_F401CC.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401CC.build.board=GENERIC_F401CC
GenF4.menu.pnum.Generic_F401CC.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401CC.build.variant=STM32F4xx/Generic_F401Cx

# Generic F401CB
GenF4.menu.pnum.Generic_F401CB=Generic F401CB
GenF4.menu.pnum.Generic_F401CB.upload.maximum_size=131072
GenF4.menu.pnum.Generic_F401CB.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401CB.build.board=GENERIC_F401CB
GenF4.menu.pnum.Generic_F401CB.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401CB.build.variant=STM32F4xx/Generic_F401Cx

# Upload menu
GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF4.menu.upload_method.swdMethod.upload.protocol=0
GenF4.menu.upload_method.swdMethod.upload.options=-g
GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF4.menu.upload_method.serialMethod.upload.protocol=1
GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF4.menu.upload_method.dfuMethod.upload.protocol=2
GenF4.menu.upload_method.dfuMethod.upload.options=-g
GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

###############################
# Generic G4
GenG4.name=Generic STM32G4 series

GenG4.build.core=arduino
GenG4.build.board=GenG4
GenG4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenG4.build.mcu=cortex-m4
GenG4.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenG4.build.series=STM32G4xx
GenG4.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Generic G431C6Ux
GenG4.menu.pnum.GENERIC_G431C6UX=Generic G431C6Ux
GenG4.menu.pnum.GENERIC_G431C6UX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431C6UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C6UX.build.board=GENERIC_G431C6UX
GenG4.menu.pnum.GENERIC_G431C6UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C6UX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU

