stm32duino/Arduino_Core_STM32/boards.txt
# FYSETC_S6 board
3dprinter.menu.pnum.FYSETC_S6=FYSETC_S6
3dprinter.menu.pnum.FYSETC_S6.upload.maximum_size=458752
3dprinter.menu.pnum.FYSETC_S6.upload.maximum_data_size=131072
3dprinter.menu.pnum.FYSETC_S6.build.mcu=cortex-m4
3dprinter.menu.pnum.FYSETC_S6.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.FYSETC_S6.build.board=FYSETC_S6
3dprinter.menu.pnum.FYSETC_S6.build.series=STM32F4xx
3dprinter.menu.pnum.FYSETC_S6.build.product_line=STM32F446xx
3dprinter.menu.pnum.FYSETC_S6.build.variant=STM32F4xx/FYSETC_S6
3dprinter.menu.pnum.FYSETC_S6.build.cmsis_lib_gcc=arm_cortexM4lf_math
3dprinter.menu.pnum.FYSETC_S6.build.flash_offset=0x10000
3dprinter.menu.pnum.FYSETC_S6.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset}

# Upload menu
3dprinter.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
3dprinter.menu.upload_method.swdMethod.upload.protocol=0
3dprinter.menu.upload_method.swdMethod.upload.options=-g
3dprinter.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
3dprinter.menu.upload_method.serialMethod.upload.protocol=1
3dprinter.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
3dprinter.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
3dprinter.menu.upload_method.dfuMethod.upload.protocol=2
3dprinter.menu.upload_method.dfuMethod.upload.options=-g
3dprinter.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg


###############################
# Generic Flight Controllers

GenFlight.name=Generic Flight Controllers

GenFlight.build.core=arduino
GenFlight.build.board=Genericflight
GenFlight.build.variant_h=variant_{build.board}.h
GenFlight.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

# AfroFlight Rev5
GenFlight.menu.pnum.AFROFLIGHT_F103CB=Afro Flight Rev5 (8MHz)
GenFlight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_size=131072
GenFlight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_data_size=20480
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.mcu=cortex-m3
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.series=STM32F1xx
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.board=AFROFLIGHT_F103CB
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.product_line=STM32F103xB
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.variant=STM32F1xx/AFROFLIGHT_F103CB

GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M=Afro Flight Rev5 (12MHz)
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_size=131072
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_data_size=20480
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.mcu=cortex-m3
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.series=STM32F1xx
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.cmsis_lib_gcc=arm_cortexM3l_math
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.board=AFROFLIGHT_F103CB_12M
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.product_line=STM32F103xB
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.variant=STM32F1xx/AFROFLIGHT_F103CB
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.variant_h=variant_AFROFLIGHT_F103CB.h

# Sparky_V1 board
GenFlight.menu.pnum.Sparky_V1=Sparky V1 F303 FC
GenFlight.menu.pnum.Sparky_V1.upload.maximum_size=262144
GenFlight.menu.pnum.Sparky_V1.upload.maximum_data_size=40960
GenFlight.menu.pnum.Sparky_V1.build.mcu=cortex-m4
GenFlight.menu.pnum.Sparky_V1.build.series=STM32F3xx
GenFlight.menu.pnum.Sparky_V1.build.cmsis_lib_gcc=arm_cortexM4lf_math
GenFlight.menu.pnum.Sparky_V1.build.board=SPARKY_F303CC
GenFlight.menu.pnum.Sparky_V1.build.product_line=STM32F303xC
GenFlight.menu.pnum.Sparky_V1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenFlight.menu.pnum.Sparky_V1.build.variant=STM32F3xx/SPARKY_F303CC

# Upload menu
GenFlight.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenFlight.menu.upload_method.swdMethod.upload.protocol=0
GenFlight.menu.upload_method.swdMethod.upload.options=-g
GenFlight.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenFlight.menu.upload_method.serialMethod.upload.protocol=1
GenFlight.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenFlight.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenFlight.menu.upload_method.dfuMethod.upload.protocol=2
GenFlight.menu.upload_method.dfuMethod.upload.options=-g
GenFlight.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenFlight.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenFlight.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenFlight.menu.upload_method.hidMethod=HID Bootloader 2.2
GenFlight.menu.upload_method.hidMethod.upload.protocol=hid22
GenFlight.menu.upload_method.hidMethod.upload.tool=hid_upload
GenFlight.menu.upload_method.hidMethod.build.flash_offset=0x800
GenFlight.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

GenFlight.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
GenFlight.menu.upload_method.dfu2Method.upload.protocol=maple
GenFlight.menu.upload_method.dfu2Method.upload.tool=maple_upload
GenFlight.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
GenFlight.menu.upload_method.dfu2Method.upload.altID=2
GenFlight.menu.upload_method.dfu2Method.build.flash_offset=0x2000
GenFlight.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

GenFlight.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
GenFlight.menu.upload_method.dfuoMethod.upload.protocol=maple
GenFlight.menu.upload_method.dfuoMethod.upload.tool=maple_upload
GenFlight.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
GenFlight.menu.upload_method.dfuoMethod.upload.altID=1
GenFlight.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
GenFlight.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Garatronic-McHobby STM32 boards

Garatronic.name=Garatronic/McHobby

Garatronic.build.core=arduino
Garatronic.build.board=Garatronic
Garatronic.build.variant_h=variant_{build.board}.h
Garatronic.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# PYBSTICK26(DUINO) board with F072RB
Garatronic.menu.pnum.PYBSTICK26_DUINO=PYBSTICK26 Duino
Garatronic.menu.pnum.PYBSTICK26_DUINO.upload.maximum_size=131072
Garatronic.menu.pnum.PYBSTICK26_DUINO.upload.maximum_data_size=16384
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.mcu=cortex-m0
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.board=PYBSTICK26_DUINO
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.series=STM32F0xx
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.product_line=STM32F072xB
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.variant=STM32F0xx/PYBSTICK26_DUINO
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.cmsis_lib_gcc=arm_cortexM0l_math

